#+TITLE:
#+AUTHOR: 
#+EMAIL: 
#+KEYWORDS:
#+DESCRIPTION:
#+TAGS:
#+LANGUAGE: en
#+OPTIONS: toc:nil
#+PANDOC_OPTIONS:
#+STARTUP: hidestars showall

** number of articles
#+BEGIN_SRC sh :dir /hadoopext:vossanto
  for i in $(seq 1987 2007); do
    echo -ne "$i\t"
    tar tzvf nyt_corpus_$i.tar.gz | grep "xml$" | wc -l
  done
#+END_SRC

|  year | articles |
|-------+----------|
|  1987 |   106104 |
|  1988 |   104541 |
|  1989 |   102818 |
|  1990 |    98812 |
|  1991 |    85135 |
|  1992 |    82685 |
|  1993 |    79200 |
|  1994 |    74925 |
|  1995 |    85392 |
|  1996 |    79077 |
|  1997 |    85396 |
|  1998 |    89163 |
|  1999 |    91074 |
|  2000 |    94258 |
|  2001 |    96282 |
|  2002 |    97258 |
|  2003 |    94235 |
|  2004 |    91362 |
|  2005 |    90004 |
|  2006 |    87052 |
|  2007 |    39953 |
|-------+----------|
| *sum* |  1854726 |
#+TBLFM: @23$2=vsum(@I..@II)

** number of vossantos

#+begin_src emacs-lisp :results none
(setq org-babel-python-command "python3")
#+end_src

#+BEGIN_SRC python :results output table raw
  year = None
  count = None
  with open("README.md", "r") as f:
      for line in f:
          # find "## Examples"
          if line.startswith("## Examples"):
              year = 0
              continue
          # find "### YEAR"
          if year is not None and line.startswith("### "):
              # output count for previous year
              if year > 0:
                  print(year, count, sep='\t')
              year = int(line[4:8])
              count = 0
              continue
          # find Vossantos
          if year is not None and year > 0 and line.startswith("- "):
              count += 1
              continue
      print(year, count, sep='\t')
#+END_SRC

#+RESULTS:
1987	19
1988	17
1989	20
1990	24
1991	20
1992	24
1993	28
1994	28
1995	26
1996	24
1997	35
1998	38
1999	35
2000	36
2001	30
2002	38
2003	39
2004	38
2005	35
2006	30
2007	13

** final result

# plot with: M-x org-plot/gnuplot
#+PLOT: title:"Vossanto" ind:1 deps:(4) type:2d with:linespoints set:grid
|  year | articles |   v01 |   v01% | VOSS01 | VOSS01‰ | prec01 |   v02 |   v02% |  v03 |   |
|-------+----------+-------+--------+--------+---------+--------+-------+--------+------+---|
|  1987 |   106104 |   792 |   7.46 |     19 |    0.18 |   2.41 |  1030 |   9.71 | 1127 |   |
|  1988 |   104541 |   734 |   7.02 |     17 |    0.16 |   2.28 |   963 |   9.21 | 1051 |   |
|  1989 |   102818 |   775 |   7.54 |     20 |    0.19 |   2.52 |   989 |   9.62 | 1067 |   |
|  1990 |    98812 |   668 |   6.76 |     24 |    0.24 |   3.55 |   860 |   8.70 |  946 |   |
|  1991 |    85135 |   583 |   6.85 |     20 |    0.23 |   3.36 |   781 |   9.17 |  861 |   |
|  1992 |    82685 |   605 |   7.32 |     24 |    0.29 |   3.96 |   777 |   9.40 |  854 |   |
|  1993 |    79200 |   503 |   6.35 |     28 |    0.35 |   5.51 |   658 |   8.31 |  742 |   |
|  1994 |    74925 |   540 |   7.21 |     28 |    0.37 |   5.13 |   689 |   9.20 |  749 |   |
|  1995 |    85392 |   626 |   7.33 |     26 |    0.30 |   4.09 |   790 |   9.25 |  853 |   |
|  1996 |    79077 |   584 |   7.39 |     24 |    0.30 |   4.06 |   773 |   9.78 |  841 |   |
|  1997 |    85396 |   632 |   7.40 |     35 |    0.41 |   5.54 |   781 |   9.15 |  835 |   |
|  1998 |    89163 |   667 |   7.48 |     38 |    0.43 |   5.75 |   859 |   9.63 |  925 |   |
|  1999 |    91074 |   604 |   6.63 |     35 |    0.38 |   5.73 |   822 |   9.03 |  881 |   |
|  2000 |    94258 |   420 |   4.46 |     36 |    0.38 |   8.52 |   604 |   6.41 |  654 |   |
|  2001 |    96282 |   365 |   3.79 |     30 |    0.31 |   8.18 |   525 |   5.45 |  585 |   |
|  2002 |    97258 |   340 |   3.50 |     38 |    0.39 |  11.14 |   497 |   5.11 |  574 |   |
|  2003 |    94235 |   331 |   3.51 |     39 |    0.41 |  11.68 |   535 |   5.68 |  609 |   |
|  2004 |    91362 |   294 |   3.22 |     38 |    0.42 |  13.04 |   487 |   5.33 |  533 |   |
|  2005 |    90004 |   300 |   3.33 |     35 |    0.39 |  11.71 |   466 |   5.18 |  517 |   |
|  2006 |    87052 |   260 |   2.99 |     30 |    0.34 |  11.37 |   405 |   4.65 |  457 |   |
|  2007 |    39953 |   121 |   3.03 |     13 |    0.33 |  10.89 |   187 |   4.68 |  211 |   |
|-------+----------+-------+--------+--------+---------+--------+-------+--------+------+---|
| *sum* |  1854726 | 10744 | 120.57 |    597 |    0.31 | 140.42 | 14478 | 162.65 |      |   |
| *avg* |    88320 |   512 |   5.74 |     28 |    0.32 |   6.69 |   689 |   7.75 |      |   |
#+TBLFM: $4=($-1/$2)*1000;%0.2f::$6=($-1/$-4)*1000;%0.2f::$7=($-1/$-3)*100;%0.2f::$9=($-1/$2)*1000;%0.2f::@23$2=vsum(@I..@II)::@23$3=vsum(@I..@II)::@23$4=vsum(@I..@II)::@23$5=vsum(@I..@II)::@23$7=vsum(@I..@II)::@23$8=vsum(@I..@II)::@23$9=vsum(@I..@II)::@24$2=@-1/vlen(@I..@II);%0.0f::@24$3=@-1/vlen(@I..@II);%0.0f::@24$4=@-1/vlen(@I..@II);%0.2f::@24$5=@-1/vlen(@I..@II);%0.0f::@24$7=@-1/vlen(@I..@II);%0.2f::@24$8=@-1/vlen(@I..@II);%0.0f::@24$9=@-1/vlen(@I..@II);%0.2f


** Frequent

#+BEGIN_SRC sh
    grep "^-" README.md | sed -e "s/[^\*]*\*[^\*]*\*[^\*]*\*//" -e "s/\*.*//" | sort | uniq -c | sort -nr \
      | sed -e "s/^ *//" -e "s/ /\t/" | awk -F'\t' '{if ($1 >= 2) print $1"\t"$2}'
#+END_SRC

#+RESULTS:
| 9 | King                |
| 7 | Queen               |
| 7 | British equivalent  |
| 6 | Pied Piper          |
| 6 | Oscars              |
| 6 | Michael Jordan      |
| 5 | Michelangelo        |
| 5 | Holy Grail          |
| 5 | Godfather           |
| 5 | General Motors      |
| 5 | Cadillac            |
| 4 | Mecca               |
| 4 | English equivalent  |
| 4 | Babe Ruth           |
| 3 | Zelig               |
| 3 | Rodney Dangerfield  |
| 3 | Neil Young          |
| 3 | Microsoft           |
| 3 | Japanese equivalent |
| 3 | Giant               |
| 3 | Elvis               |
| 3 | Don Quixote         |
| 3 | Champs-Elysees      |
| 3 | Canadian equivalent |
| 3 | British version     |
| 2 | Yankee Stadium      |
| 2 | Wizard              |
| 2 | Wild West           |
| 2 | Voice               |
| 2 | Thomas Jefferson    |
| 2 | Super Bowl          |
| 2 | Sultan              |
| 2 | Stradivarius        |
| 2 | Simon Cowell        |
| 2 | Silicon Valley      |
| 2 | Rush Limbaugh       |
| 2 | Ronald Reagan       |
| 2 | Rolls-Royce         |
| 2 | Robert Moses        |
| 2 | Riviera             |
| 2 | Rangers             |
| 2 | Ralph Nader         |
| 2 | Picasso             |
| 2 | Paul Newman         |
| 2 | Paul Bunyan         |
| 2 | Nolan Ryan          |
| 2 | Mr. October         |
| 2 | Mozart              |
| 2 | Mister Rogers       |
| 2 | Mexican equivalent  |
| 2 | Mercedes-Benz       |
| 2 | Man                 |
| 2 | Mad Hatter          |
| 2 | Lord                |
| 2 | London equivalent   |
| 2 | Larry Bird          |
| 2 | John Wayne          |
| 2 | Johnny Appleseed    |
| 2 | James Brown         |
| 2 | Houdini             |
| 2 | Great Satan         |
| 2 | God                 |
| 2 | French equivalent   |
| 2 | Everest             |
| 2 | European equivalent |
| 2 | Energizer Bunny     |
| 2 | Ellis Island        |
| 2 | Detroit             |
| 2 | Czar                |
| 2 | Buddha              |
| 2 | Boswell             |
| 2 | Bill Gates          |
| 2 | Beverly Hills       |
| 2 | American mecca      |
| 2 | Age                 |

#+BEGIN_SRC sh :results raw output
  grep -E "Pied Piper" README.md
#+END_SRC

- *Gregory Hines* is the *Pied Piper* of *modern tap* (1992/12/25/0578860)
- *Robert B. Reich*, the *Pied Piper* of *high performance* (1994/06/05/0691688)
- *Russell Cera*, the *Pied Piper* of *education* (1994/07/03/0697153)
- *Carl Rogers*, the *Pied Piper* of "*self-actualization*" (1997/12/18/0981253)
- *Ken Kesey*, the *Pied Piper* of the *psychedelic era* (2001/11/11/1342116)
- *George Gilder*, the *Pied Piper* of *telecommunications investors* (2003/12/14/1543026)

#+BEGIN_SRC sh :results raw output
  grep -E "Michael Jordan" README.md
#+END_SRC

- *Romario* is the *Michael Jordan* of *soccer* and *Bebeto* is the *Magic Johnson* of *soccer* (1994/07/05/0697643)
- *Michael Jordan* is the *God* of *Chicago* (1995/03/12/0748227)
- *Bonfire*, the *Michael Jordan* of *dressage horses* (1998/11/05/1059693)
- *Brian Foster*, the *Michael Jordan* of *BMX racing* (1998/12/27/1072824)
- The stunt biker *Dave Mirra*, the *Michael Jordan* of the *dirt set* (2000/08/13/1222322)
- *Cynthia Cooper* is the *Michael Jordan*, the *Larry Bird*, the *Magic Johnson* of *this league* (2000/08/28/1226010)
- *McNabb* has been called the *Michael Jordan* of the *National Football League* (2001/01/08/1261308)

#+BEGIN_SRC sh :results raw output
  grep -E "Michelangelo" README.md
#+END_SRC

- *Barnum* - the *Michelangelo* of *buncombe*, *hokum*, *hoopla* and *ballyhoo* (1989/06/06/0256423)
- *Michael J. Deaver*, the *Michelangelo* of the *balloon drop* (1996/08/13/0871265)
- *Mel Gibson* is the *Michelangelo* of *this generation* (2003/08/02/1508990)
- *Kyle Avila*, the *Michelangelo* of the *bunch* (2006/12/17/1812547)
- *Mr. Gunn* is the *Michelangelo* of *the form* (2007/04/12/1839640)

#+BEGIN_SRC sh :results raw output
  grep -E "General Motors" README.md
#+END_SRC

- *Delta Pride*, the *General Motors* of *catfish processing factories* (1990/12/10/0407519)
- *Vaz Auto Works*, the *General Motors* of *Russia* (1992/03/08/0512599)
- *Starbucks Coffee*, the *General Motors* of *espresso* (1993/12/22/0657572)
- *Mr. Lovano* is the *General Motors* of *jazz* (1995/01/15/0736903)
- the *Estee Lauder Companies*, the *General Motors* of the *cosmetics world* (1999/01/10/1075990)

#+BEGIN_SRC sh :results raw output
  grep -E "Cadillac" README.md
#+END_SRC

- "*New York State* is the *Cadillac* of *social services*," Mr. Alfonso said. "*Other states* have *Volkswagens*."  (1990/11/26/0404144)
- "*New York* is the *Cadillac* of *welfare states*," he said. "We can't afford it anymore. What we need is *Chevys* and *Fords* in this state." (1991/01/31/0419226)
- *Eldredge* is the *Cadillac* among *Ferraris* (2002/02/12/1367217)
- the *Eldorado* has been the *Cadillac* of *Cadillacs* (2002/05/10/1390973)
- *MagLiner*, the *Cadillac* of *hand trucks* (2002/06/09/1399279)

#+BEGIN_SRC sh :results raw output
  grep -E "Babe Ruth" README.md
#+END_SRC

- *Eddie Shore*, the *Babe Ruth* of *hockey* (1988/11/04/0194523)
- *Jack B. Solerwitz* is the *Babe Ruth* of *ripoffs* (1993/03/19/0596753)
- *Rush Limbaugh*, the *Babe Ruth* of the *talk-show circuit* (1995/01/05/0735173)
- *Babe Ruth*, the *Sultan* of *Swat* (1995/11/27/0811882)
- *Eric Bergoust*, the *Babe Ruth* of *freestyle aerials* (2003/01/23/1458686)

